{
  "full_name": "Charlene Xu",
  "profile_pic": "s3942372/profile/profile.webp",
  "primary_specialization": "UX/UI Design",
  "secondary_skills": ["Front-end Coding", "Game Design"],
  "graduation_year": "2025",
  "website": "https://charlenexu-portfolio.deno.dev",
  "bio": "Charlene Xu is a passionate UX/UI designer who also loves crafting experiences through game and web. An avid lover of both interaction design and storytelling, Charlene enjoys crafting engaging narrative experiences through thoughtful design and gamification. Having undergone RMIT University's Bachelor's Degree of Design (Digital Media), she has a great amount of interest and passion in games and gamified experiences that can not only captivate users, but also immerse them in the compelling narratives. Willing to explore new innovative ways to blend aesthetics with gameplay elements to enhance user engagement, Charlene wishes to explore a career in both UI/UX and the games industry as a narrative and interface designer.",

  "key_projects": [
    {
      "title": "Xero Start",
      "project_type": "UXUI",
      "project_cover_image": "s3942372/projects/project1.webp",
      "project_description": "A project completed for 'Xero', the app, 'Xero Start' is meant to be an intro to business for aspiring entrepreneurs who don't know where to start. With a focus on users with dyslexia and others with similar disadvantages, 'Xero Start' provides an easy to use, easy to understand way of providing lessons to users.<br />Try the prototype out for yourself: https://www.figma.com/proto/rec1OZlazFwuZgQS20KF1K/Low-Fidelity-Prototype?page-id=373%3A471&node-id=407-4849&p=f&viewport=1555%2C-4063%2C0.45&t=SlqbTFaSm3mjfT1t-1&scaling=scale-down&content-scaling=fixed&starting-point-node-id=407%3A4849",
      "youtube_link": ""
    },
    {
      "title": "Project: Buddy (Beta)",
      "project_type": "UXUI",
      "project_cover_image": "s3942372/projects/project2.webp",
      "project_description": "'Project: Buddy (Beta)' is a satirical web experience meant to make fun of the rise in AI in health care services such as online therapy and counselling. Through a simple interface and by clicking through options, the user dives deeper and deeper into their 'therapy' session with an AI.<br />Experience it for yourself: https://s3942372.github.io/im-2310/a3/",
      "youtube_link": ""
    },
    {
      "title": "Punchin' Time!",
      "project_type": "UXUI",
      "project_cover_image": "s3942372/projects/project3.webp",
      "project_description": "'Punchin' Time!' Is a game made on Scratch meant to encapsulate one of the major reasons behind school bullying, how it starts, and why it continues. Based on personal experience, this game allows users to take on the role of the bully through one simple act: clicking. Will you be able to resist?<br />Test the game out here: https://scratch.mit.edu/projects/1075088739/fullscreen/",
      "youtube_link": ""
    }
  ]
}
